### Create pandas dataframe

In [3]:
import pandas as pd
import numpy as np

### create a dataframe from pandas using Dictionaries

In [2]:
data = {'student':['Reena','neeta','meeta','sunita'],'year':[1,2,3,1],'marks':[9.9,6.8,7,8]}

### make a dataframe

In [3]:
data_df = pd.DataFrame(data)

### How to access last and first row of the dataframe (head() and tail())

In [6]:
data_df.head(1)
data_df.tail(1)

  student  year  marks
3  sunita     1    8.0

### How to Change the Column in Pandas DataFrame

In [7]:
data_df = pd.DataFrame(data,columns = ['student','marks','year'])

### How to Access the Columns in Pandas DataFrame

In [8]:
data_df['year']
#or
#data_df.year

0    1
1    2
2    3
3    1
Name: year, dtype: int64

### How to Access the Rows in DataFrames
#### using loc,iloc

In [10]:
data_df.loc[2]

student    meeta
marks          7
year           3
Name: 2, dtype: object

### Various Assignments and Operations on Pandas DataFrame

In [11]:
data_df2= pd.DataFrame(data, columns=['student','marks','year','subjects'])
data_df2

  student  marks  year subjects
0   Reena    9.9     1      NaN
1   neeta    6.8     2      NaN
2   meeta    7.0     3      NaN
3  sunita    8.0     1      NaN

####  cool feature of Pandas is that you assign a column with a certain constant value

In [12]:
data_df2['subjects'] = 2
data_df2

  student  marks  year  subjects
0   Reena    9.9     1         2
1   neeta    6.8     2         2
2   meeta    7.0     3         2
3  sunita    8.0     1         2

### series can be mapped onto a column in a DataFrame

In [15]:
ser=pd.Series([2,3],index=[1,3])

In [16]:
data_df2['subjects']=ser
data_df2

  student  marks  year  subjects
0   Reena    9.9     1       NaN
1   neeta    6.8     2       2.0
2   meeta    7.0     3       NaN
3  sunita    8.0     1       3.0

### boolean assignments on operators can be performed

In [17]:
data_df2['grade'] = data_df2.marks>7
data_df2

  student  marks  year  subjects  grade
0   Reena    9.9     1       NaN   True
1   neeta    6.8     2       2.0  False
2   meeta    7.0     3       NaN  False
3  sunita    8.0     1       3.0   True

### How to Delete Columns in Pandas DataFrame

In [18]:
del data_df2['grade']
data_df2

  student  marks  year  subjects
0   Reena    9.9     1       NaN
1   neeta    6.8     2       2.0
2   meeta    7.0     3       NaN
3  sunita    8.0     1       3.0

### How to Delete Rows in Pandas DataFrame

In [23]:
data_df2.student.drop(['Reena'])
data_df2

KeyError: "['Reena'] not found in axis"

### Pandas DataFrame with Nested Dictionaries

In [1]:
dict={'fruits':{'apple':40,'orange':20,'bananas':25,'grapes':30}, 'vegetables':{'carrot':20,'beans':16,'peas':30,'onion':25}}

In [5]:
data_df3 = pd.DataFrame(dict)
data_df3

         fruits  vegetables
apple      40.0         NaN
orange     20.0         NaN
bananas    25.0         NaN
grapes     30.0         NaN
carrot      NaN        20.0
beans       NaN        16.0
peas        NaN        30.0
onion       NaN        25.0

### How to Transpose Pandas DataFrames

In [6]:
data_df3.T

            apple  orange  bananas  grapes  carrot  beans  peas  onion
fruits       40.0    20.0     25.0    30.0     NaN    NaN   NaN    NaN
vegetables    NaN     NaN      NaN     NaN    20.0   16.0  30.0   25.0

### Iterating over the Rows and Columns of Dataframe

In [7]:
dataflair_new= { 'fruit': ["Guava", "Apple", "Oranges"], 'price':[40, 120, 60]}

In [8]:
data_df4 = pd.DataFrame(dataflair_new)
data_df4

     fruit  price
0    Guava     40
1    Apple    120
2  Oranges     60

In [9]:
for i, j in data_df4.iterrows():
     print(i,j)

0 fruit    Guava
price       40
Name: 0, dtype: object
1 fruit    Apple
price      120
Name: 1, dtype: object
2 fruit    Oranges
price         60
Name: 2, dtype: object

In [10]:
for i, j in data_df4.iteritems():
     print(i,j)

fruit 0      Guava
1      Apple
2    Oranges
Name: fruit, dtype: object
price 0     40
1    120
2     60
Name: price, dtype: int64

### How to Rename a Column in Pandas DataFrames

In [11]:
data_df4.rename(index=str, columns={"fruit": "a", "price": "c"})

         a    c
0    Guava   40
1    Apple  120
2  Oranges   60

In [ ]:
data_df4.rename(index=str, columns={"a":"fruit","c": "price"})

### Stacking and Unstacking of DataFrames

In [12]:
data_st = data_df4.stack()
data_st

0  fruit      Guava
   price         40
1  fruit      Apple
   price        120
2  fruit    Oranges
   price         60
dtype: object

In [13]:
data_st.unstack()

     fruit price
0    Guava    40
1    Apple   120
2  Oranges    60

### Setting a List as an Index in Pandas DataFrames

In [14]:
id=['one','two', 'three']
data_df4.index = id
data_df4

         fruit  price
one      Guava     40
two      Apple    120
three  Oranges     60

### Selecting values from a DataFrame according to index

In [17]:
data_df4.loc["one"]

fruit    Guava
price       40
Name: one, dtype: object

### Working with Missing Values

In [18]:
data_dict={'Data':[1, np.nan, 8, 9, np.nan], 'name':["Ron","Harry","Hermione","Neville","Dobby"]}
data_pdx = pd.DataFrame(data_dict)
data_pdx

   Data      name
0   1.0       Ron
1   NaN     Harry
2   8.0  Hermione
3   9.0   Neville
4   NaN     Dobby

In [19]:
data_pdx.isnull()

    Data   name
0  False  False
1   True  False
2  False  False
3  False  False
4   True  False

In [20]:
data_pdx.fillna('Not available')

            Data      name
0              1       Ron
1  Not available     Harry
2              8  Hermione
3              9   Neville
4  Not available     Dobby

In [22]:
data_pdx.dropna()

   Data      name
0   1.0       Ron
2   8.0  Hermione
3   9.0   Neville